# 1.路由器(网关设备)
#   1.连接因特网中各局域网/广域网 ~ 连接多个逻辑上分开的网络
#       1.逻辑网: 单独的网络或子网
#   2.根据信道情况自动选择和设定路由, 以最佳路径有序发送信号
#       1.具有判断网络地址和选择IP路径功能, 能在多网互联环境中, 建立灵活链接, 可用完全不同的数据分组和介质访问方法链接各子网, 只接受源站或其他路由器的信息, 属于网络层设备
#       2.通过路由决定数据转发, 转发策略称为路由选择 ~ 这也是路由器名称的由来 ~ router 转发者
#   3.路由器是互联网路的枢纽和交警
#   4.分类
#     1.本地路由器: 连接网络传输介质(1.光纤 2.同轴电缆 3.双绞线)
#     2.远程路由器: 连接远程传输介质, 且要求相应设备
#       eg. 1.电话线要配调制解调器
#           2.无线要配接收机, 发射机
# 2.路由器各端口都有一个网卡
#   1.每个网卡和其连接的网络中的其他主机在同一网段, 可以互相通信
#   2.在路由器内部各端口网卡互相通信, 进而实现不同网络中的主机之间通信, 即连接不同网络


