import multiprocessing
import time
import os

print(f'{os.getpid():->60}')


def fun():
    for i in range(5):
        print(f'子进程{i}{os.getpid():->30}')
        time.sleep(1)


p1 = multiprocessing.Process(target=fun)

# win平台不遵循 Programming guidelines (https://docs.python.org/3/library/multiprocessing.html#programming-guidelines) 报错
# p1.start()
#
# while True:
#     print('*' * 30)
#     time.sleep(2)

if __name__ == '__main__':
    p1.start()

    print(os.getpid())
    for i in range(5):
        print(f'主进程{i}{os.getpid():*>30}')
        time.sleep(1)

# 在multiprocessing包中, 进程通过创建Process类的实例对象来生成
# 更多总结参见: demo12_进程池.py

'''
--------------------------------------------------------3852
3852
主进程0**************************3852
--------------------------------------------------------3692
子进程0--------------------------3692
主进程1**************************3852
子进程1--------------------------3692
主进程2**************************3852
子进程2--------------------------3692
'''

'''Linux平台输出 .....也是醉了....说好的跨平台呢?
--------------------------------------------------------5049
5049
主进程0**************************5049
子进程0--------------------------5050
主进程1**************************5049
子进程1--------------------------5050
主进程2**************************5049
子进程2--------------------------5050

'''